| Comment: LSASS Memory Dump via ProcDump
| Comment: Detects credential dumping from LSASS using ProcDump or similar tools
| Comment: MITRE ATT&CK Tags: attack.credential_access, attack.t1003.001
index=windows sourcetype=WinEventLog:Security
| search ((CommandLine="*lsass*")) OR ((CommandLine="*rundll32*" AND CommandLine="*comsvcs.dll*" AND CommandLine="*MiniDump*"))
| table _time, host, user, CommandLine, Image, EventID
| sort -_time